CSI API ETABS v1
cPointObj.GetPanelZone Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetPanelZone(
	string Name,
	ref int PropType,
	ref double Thickness,
	ref double K1,
	ref double K2,
	ref string LinkProp,
	ref int Connectivity,
	ref int LocalAxisFrom,
	ref double LocalAxisAngle
)
Function GetPanelZone (
	Name As String,
	ByRef PropType As Integer,
	ByRef Thickness As Double,
	ByRef K1 As Double,
	ByRef K2 As Double,
	ByRef LinkProp As String,
	ByRef Connectivity As Integer,
	ByRef LocalAxisFrom As Integer,
	ByRef LocalAxisAngle As Double
) As Integer
Dim instance As cPointObj
Dim Name As String
Dim PropType As Integer
Dim Thickness As Double
Dim K1 As Double
Dim K2 As Double
Dim LinkProp As String
Dim Connectivity As Integer
Dim LocalAxisFrom As Integer
Dim LocalAxisAngle As Double
Dim returnValue As Integer
returnValue = instance.GetPanelZone(Name,
	PropType, Thickness, K1, K2, LinkProp,
	Connectivity, LocalAxisFrom, LocalAxisAngle)
int GetPanelZone(
	String^ Name,
	int% PropType,
	double% Thickness,
	double% K1,
	double% K2,
	String^% LinkProp,
	int% Connectivity,
	int% LocalAxisFrom,
	double% LocalAxisAngle
)
abstract GetPanelZone :
        Name : string *
        PropType : int byref *
        Thickness : float byref *
        K1 : float byref *
        K2 : float byref *
        LinkProp : string byref *
        Connectivity : int byref *
        LocalAxisFrom : int byref *
        LocalAxisAngle : float byref -> int
Parameters
Name
Type: System.String
PropType
Type: System.Int32
Thickness
Type: System.Double
K1
Type: System.Double
K2
Type: System.Double
LinkProp
Type: System.String
Connectivity
Type: System.Int32
LocalAxisFrom
Type: System.Int32
LocalAxisAngle
Type: System.Double
Return Value
Type: Int32
See Also
Reference
cPointObj Interface
ETABSv1 Namespace